------------------------ MODULE Ex1_Clock_Fixed ------------------------
(***************************************************************************)
(* Пример 1 (Исправленный вариант). Настенные часы.                        *)
(* Решение: добавлено зацикливание (после 12 стрелка переходит на 1).       *)
(***************************************************************************)
EXTENDS Naturals

VARIABLE hour

Init == hour = 1

\* Исправление: корректный циклический переход
Next == hour' = IF hour = 12 THEN 1 ELSE hour + 1

\* Инвариант: часы обязаны быть в диапазоне 1..12
TypeOK == hour \in 1..12

========================================================================
