---------------------------- MODULE Ex1_Clock ----------------------------
(***************************************************************************)
(* Пример 1. Настенные часы, показывающие только час (1..12).              *)
(* Классический первый пример Лесли Лэмпорта.                             *)
(* Цель: понять Init, Next, штрих (') и инвариант.                         *)
(***************************************************************************)
EXTENDS Naturals            \* подключаем натуральные числа: +, -, <, 1..12

VARIABLE hour               \* единственная переменная состояния

\* Начальное состояние: условие, которое истинно в момент старта.
Init == hour = 1

\* Шаг системы: связь между текущим hour и следующим hour'.
\* hour' читается как "значение hour в СЛЕДУЮЩЕМ состоянии".
Next == hour' = IF hour = 12 THEN 1 ELSE hour + 1

\* Инвариант: условие, которое обязано быть истинным в КАЖДОМ состоянии.
TypeOK == hour \in 1..12

=============================================================================
