------------------------ MODULE Ex1_Clock_Buggy ------------------------
(***************************************************************************)
(* Пример 1 (Ошибочный вариант). Настенные часы.                           *)
(* Баг: стрелка инкрементируется без зацикливания после 12.               *)
(***************************************************************************)
EXTENDS Naturals

VARIABLE hour

Init == hour = 1

\* Ошибка: просто прибавляем 1 без проверки достижения 12
Next == hour' = hour + 1

\* Инвариант: часы обязаны быть в диапазоне 1..12
TypeOK == hour \in 1..12

========================================================================
