---------------------- MODULE Ex2_TrafficLight_Buggy ----------------------
(***************************************************************************)
(* Пример 2 (Ошибочный вариант). Светофор на перекрёстке.                  *)
(* Баг: каждый светофор переключается независимо от второго.               *)
(* Итог: оба светофора могут одновременно стать зелёными (авария).        *)
(***************************************************************************)

VARIABLES 
    lightNS,    \* Сигнал светофора Север-Юг: "red" или "green"
    lightEW     \* Сигнал светофора Восток-Запад: "red" или "green"

vars == <<lightNS, lightEW>>

Init ==
    /\ lightNS = "green"
    /\ lightEW = "red"

\* Независимое переключение Север-Юг
SwitchNS ==
    /\ lightNS' = IF lightNS = "red" THEN "green" ELSE "red"
    /\ UNCHANGED lightEW

\* Независимое переключение Восток-Запад
SwitchEW ==
    /\ lightEW' = IF lightEW = "red" THEN "green" ELSE "red"
    /\ UNCHANGED lightNS

Next == SwitchNS \/ SwitchEW

-----------------------------------------------------------------------------
TypeOK ==
    /\ lightNS \in {"red", "green"}
    /\ lightEW \in {"red", "green"}

\* ИНВАРИАНТ БЕЗОПАСНОСТИ:
\* На перекрёстке НИКОГДА не должны гореть два зелёных одновременно!
SafetyNoCrash ==
    ~ (lightNS = "green" /\ lightEW = "green")

===========================================================================
